-- ========================================================
-- 시나리오 관련 초기 데이터
-- ========================================================

-- 1. 시나리오 카테고리
INSERT INTO category (category_name)
VALUES ('HOUSING'), ('IDENTITY');

-- 2. 전입신고 시나리오
INSERT INTO scenario (
    scenario_title,
    description,
    estimated_minutes,
    is_active,
    category_id
)
VALUES ('전입신고','거주지를 이동한 경우, 전입한 날부터 14일 이내에 새로운 거주지의 관할 기관에 전입신고를 해야 합니다.
해봄의 전입신고 시뮬레이션에서는 실제 민원 신청에 앞서 이사 전·후 주소 입력, 이사하는 가족 선택, 세대주 및 가족관계 설정, 우편물 이전 서비스 신청 등 전입신고의 주요 과정을 단계별로 체험할 수 있습니다.',
5,1,1),
('주민등록증 재발급','주민등록증을 분실하거나 훼손하는 등의 사유로 새로운 주민등록증이 필요한 경우 재발급을 신청할 수 있습니다.
해봄의 주민등록증 재발급 시뮬레이션에서는 재발급 사유 선택, 신청정보 입력 및 신청 절차 확인 등 주민등록증 재발급의 주요 과정을 단계별로 미리 체험할 수 있습니다.',
3,0,2);

-- 3. 전입신고 단계
INSERT INTO scenario_step (
	scenario_id,
	step_order, 
	step_title, 
	step_description)
VALUES (1, 0, '사전정보 입력',
 '전입신고 연습에 필요한 사전정보를 입력해 보세요.'),
(1, 1, '유의사항',
 '전입신고 전에 알아두어야 할 유의사항을 확인해 보세요.'),
(1, 2, '기본 정보',
 '신청에 필요한 기본 정보를 확인하고 입력해 보세요.'),
(1, 3, '이전 주소',
 '이사하기 전 주소를 확인하고 입력해 보세요.'),
(1, 4, '현재 주소',
 '이사 후 주소와 세대 구성 정보를 확인하고 입력해 보세요.');